Repository: PikaOS-Linux/pkg-gnome-shell-extension-pika-darkmode
Catalog: src/po/*.po
Languages: ar, eu, gl, hu, it, pl, pt_br, ru

source: Settings version
ar: إصدار الإعدادات
eu: Konfigurazioaren bertsioa
gl: Versión da configuración
hu: Beállítások verziója
it: Versione delle impostazioni
pl: Wersja ustawień
pt_br: Versão das configurações
ru: Версия настроек

source: The current extension settings version
ar: إصدار إعدادات الامتداد الحالي
eu: Hedapenaren konfigurazioaren egungo bertsioa
gl: A versión actual da configuración da extensión
hu: A jelenlegi kiterjesztés beállításainak verziója
it: La versione corrente delle impostazioni delle estensioni
pl: Obecna wersja ustawień rozszerzenia
pt_br: A versão atual das configurações de extensão
ru: Текущая версия настроек расширения

source: Switch GTK theme
ar: تبديل سمة GTK
hu: GTK-téma átváltása
it: Cambia il tema GTK
pl: Zmiana motywu GTK
pt_br: Mudar tema GTK
ru: Переключить тему GTK

source: Enable GTK variants switching
ar: تفعيل تبديل متغيرات GTK
eu: GTKren aldaeren aldaketa gaitu
gl: Habilitar o cambio das variantes de GTK
hu: GTK-változatok átváltásának engedélyezése
it: Abilita il cambio del tema GTK
pl: Włącz zmianę wariantów GTK
pt_br: Habilitar mudança de variantes GTK
ru: Включить переключение вариантов GTK

source: Day GTK theme
ar: سمة GTK النهارية
eu: Eguneko GTK gaia
gl: Tema GTK diurno
hu: Nappali GTK-téma
it: Tema GTK diurno
pl: Dzienny motyw GTK
pt_br: Tema GTK diurno
ru: Дневная тема GTK

source: The GTK theme to use during daytime
ar: سمة GTK للاستخدام أثناء النهار
eu: Egunez erabiltzeko GTK gaia
gl: O tema GTK para usar durante o día
hu: A nappal használandó GTK-téma
it: Il tema GTK da usare di giorno
pl: Motyw GTK używany podczas dnia
pt_br: Tema GTK para usar durante o dia
ru: Тема GTK, используемая днём

source: Night GTK theme
ar: سمة GTK الليلية
eu: Gaueko STK gaia
gl: Tema GTK nocturno
hu: Éjszakai GTK-téma
it: Tema GTK notturno
pl: Nocny motyw GTK
pt_br: Tema GTK noturno
ru: Ночная тема GTK

source: The GTK theme to use during nighttime
ar: سمة GTK للاستخدام أثناء الليل
eu: GTK gaia gauez erabiltzeko
gl: O tema GTK para usar durante a noite
hu: Az éjszaka használandó GTK-téma
it: Il tema GTK da usare di notte
pl: Motyw GTK używany podczas nocy
pt_br: Tema GTK para usar durante a noite
ru: Тема GTK, используемая ночью

source: Switch Shell theme
ar: تبديل سمة الصَّدَفة
hu: Shell-téma átváltása
it: Cambia il tema della shell
pl: Zmiana motywu powłoki
pt_br: Alternar tema do Shell
ru: Переключить тему оболочки

source: Enable shell variants switching
ar: تفعيل تبديل متغيرات الصَّدَفة
eu: Shell aldaeren aldaketa gaitu
gl: Habilitar o cambio de variantes da Shell
hu: Shell-változatok átváltásának engedélyezése
it: Abilita il cambio del tema della shell
pl: Włącz zmianę wariantów powłoki
pt_br: Habilitar troca de temas do shell
ru: Включить переключениe вариантов оболочки

source: Day shell theme
ar: سمة الصّدَفة النهارية
eu: Eguneko shell gaia
gl: Tema da Shell diurno
hu: Nappali Shell-téma
it: Tema della shell diurno
pl: Dzienny motyw powłoki
pt_br: Tema diurno do shell
ru: Дневная тема оболочки

source: The shell theme to use during daytime
ar: سمة الصّدَفة لاستخدامها خلال النهار
eu: Egunez erabiltzeko shell gaia
gl: O tema da Shell para usar durante o día
hu: A nappal használandó Shell-téma
it: Il tema della shell da usare di giorno
pl: Motyw powłoki używany podczas dnia
pt_br: Tema do shell para usar durante o dia
ru: Тема оболочки для использования в дневное время

source: Night shell theme
ar: سمة الصّدَفة الليلية
eu: Gaueko shell gaia
gl: Tema das Shell nocturno
hu: Éjszakai Shell-téma
it: Tema della shell notturno
pl: Nocny motyw powłoki
pt_br: Tema noturno do shell
ru: Ночная тема оболочки

source: The shell theme to use during nighttime
ar: سمة الصّدَفة التي سيتم استخدامها أثناء الليل
eu: Gauean erabiltzeko shell gaia
gl: O tema da Shell para usar durante a noite
hu: Az éjszaka használandó Shell-téma
it: Il tema della shell da usare di notte
pl: Motyw powłoki używany podczas nocy
pt_br: Tema do shell para usar durante a noite
ru: Тема оболочки для использования в ночное время

source: Switch icon theme
ar: تبديل أيقونة السمة
hu: Ikontéma átváltása
it: Cambia il tema delle icone
pl: Zmiana motywu ikon
pt_br: Alternar tema de ícone
ru: Переключить тему иконок

source: Enable icon variants switching
ar: تفعيل تبديل متغيرات الأيقونات
eu: Ikono-aldaeren aldaketa aktibatu
gl: Habilitar o cambio das variantes de iconas
hu: Ikonváltozatok átváltásának engedélyezése
it: Abilita il cambio del tema delle icone
pl: Włącz zmianę wariantów ikon
pt_br: Habilitar troca de variantes de ícone
ru: Включить переключение вариантов иконок

source: Day icon theme
ar: أيقونات السمة النهارية
eu: Eguneko ikonoen gaia
gl: Tema de iconas diurno
hu: Nappali ikontéma
it: Tema delle icone diurno
pl: Dzienny motyw ikon
pt_br: Tema de ícone diurno
ru: Дневная тема иконок

source: The icon theme to use during daytime
ar: سمة الأيقونات المراد استخدامها أثناء النهار
eu: Egunez erabiltzeko ikonoen gaia
gl: O tema de iconas para usar durante o día
hu: A nappal használandó ikontéma
it: Il tema delle icone da usare di giorno
pl: Motyw ikon używany podczas dnia
pt_br: Tema de ícone para usar durante o dia
ru: Тема иконок для использования в дневное время

source: Night icon theme
ar: أيقونات السمة الليلية
eu: Gaueko ikonoen gaia
gl: Tema de iconas nocturno
hu: Éjszakai ikontéma
it: Tema delle icone notturno
pl: Nocny motyw ikon
pt_br: Tema de ícone noturno
ru: Ночная тема иконок

source: The icon theme to use during nighttime
ar: أيقونات السمة المستخدمة أثناء الليل
eu: Gauean erabiltzeko ikonoen gaia
gl: O tema de iconas para usar durante a noite
hu: Az éjszaka használandó ikontéma
it: Il tema delle icone da usare di notte
pl: Motyw ikon używany podczas nocy
pt_br: Tema de ícone para usar durante a noite
ru: Тема иконок для использования в ночное время

source: Switch cursor theme
ar: تبديل مؤشر السمة
hu: Kurzortéma átváltása
it: Cambia il tema del cursore
pl: Zmiana motywu kursora
pt_br: Mudar tema do cursor
ru: Переключить тему курсора

source: Enable cursor variants switching
ar: تفعيل تبديل متغيرات المؤشر
eu: Kurtsorearen aldaeren aldaketa aktibatu
gl: Habilitar o cambio das variantes do cursor
hu: Kurzorváltozatok átváltásának engedélyezése
it: Abilita il cambio del tema del cursore
pl: Włącz zmianę wariantów kursora
pt_br: Habilitar troca de variantes do cursor
ru: Включить переключение вариантов курсора

source: Day cursor theme
ar: مؤشر السمة النهارية
eu: Eguneko kurtsorearen gaia
gl: Tema do cursor diurno
hu: Nappali kurzortéma
it: Tema del cursore diurno
pl: Dzienny motyw kursora
pt_br: Tema diurno do cursor
ru: Дневная тема курсора

source: The cursor theme to use during daytime
ar: مؤشر السمة المستخدمة أثناء النهار
eu: Egunez erabiltzeko kurtsorearen gaia
gl: O tema do cursor para usar durante o día
hu: A nappal használandó kurzortéma
it: Il tema del cursore da usare di giorno
pl: Motyw kursora używany podczas dnia
pt_br: Tema do cursor para usar durante o dia
ru: Тема курсора для использования в дневное время

source: Night cursor theme
ar: مؤشر السمة الليلية
eu: Gaueko kurtsorearen gaia
gl: Tema do cursor nocturno
hu: Éjszakai kurzortéma
it: Tema del cursore notturno
pl: Nocny motyw kursora
pt_br: Tema noturno do cursor
ru: Ночная тема курсора

source: The cursor theme to use during nighttime
ar: مؤشر السمة المستخدمة أثناء الليل
eu: Kurtsorearen gaia gauez erabiltzeko
gl: O tema do cursor para usar durante a noite
hu: Az éjszaka használandó kurzortéma
it: Il tema del cursore da usare di notte
pl: Motyw kursora używany podczas nocy
pt_br: Tema do cursor para usar durante a noite
ru: Тема курсора для использования в ночное время

source: Enable commands
ar: تمكين الأوامر
eu: Komandoak aktibatu
gl: Habilitar ordes
hu: Parancsok engedélyezése
it: Abilita i comandi
pl: Włącz polecenia
pt_br: Habilitar comandos
ru: Включить команды

source: Commands will be spawned on time change
ar: سيتم إنتاج الأوامر عند تغيير الوقت
eu: Komandoak ordutegi-aldaketan sortuko dira
gl: As ordes executaranse no cambio de horario
hu: A parancsok az idő megváltozásakor lesznek végrehajtva
it: I comandi verranno eseguiti al cambio di orario
pl: Polecenia będą uruchamiane podczas zmiany czasu
pt_br: Os comandos serão rodados na mudança de tempo
ru: Команды будут появляться при изменении времени

source: Sunrise command
ar: أمر شروق الشمس
eu: Egunsentiko komandoa
gl: Orde ao amencer
hu: Napfelkelte parancs
it: Comando all'alba
pl: Polecenie o wschodzie słońca
pt_br: Comando ao nascer do sol
ru: Команда "Восход солнца"

source: The command to spawn at sunrise
ar: أمر الظهور عند شروق الشمس
eu: Egunsentian sortuko den komandoa
gl: A orde que se executará ao amencer
hu: A napfelkeltekor futtatandó parancs
it: Il comando da eseguire all'alba
pl: Polecenie uruchamiane podczas wschodu słońca
pt_br: Comando para rodar ao nascer do sol
ru: Команда к появлению на восходе

source: Sunset command
ar: أمر الغروب
eu: Ilunabarreko komandoa
gl: Orde ao atardecer
hu: Napnyugta parancs
it: Comando al tramonto
pl: Polecenie o zachodzie słońca
pt_br: Comando ao se pôr do sol
ru: Команда "Закат солнца"

source: The command to spawn at sunset
ar: أمر الظهور عند غروب الشمس
eu: Ilunabarrean sortuko den komandoa
gl: A orde a executar ao atardecer
hu: A napnyugtakor futtatandó parancs
it: Il comando da eseguire al tramonto
pl: Polecenie uruchamiane podczas zachodu słońca
pt_br: Comando para rodar ao pôr do sol
ru: Команда к появлению на закате

source: Day background
ar: خلفية النهار
eu: Eguneko fondoa
gl: Fondo diurno
hu: Nappali háttér
it: Sfondo diurno
pl: Dzienne tło
pt_br: Plano de fundo diurno
ru: Дневной фон

source: Path to the day background
ar: مسار خلفية النهار
eu: Ibilbidea eguneko fondora
gl: Ruta ao fondo diurno
hu: A nappali háttér elérési útja
it: Percorso dello sfondo diurno
pl: Ścieżka do dziennego tła
pt_br: Caminho para o plano de fundo diurno
ru: Путь к дневному фону

source: Night background
ar: خلفية الليل
eu: Gaueko fondoa
gl: Fondo nocturno
hu: Éjszakai háttér
it: Sfondo notturno
pl: Nocne tło
pt_br: Plano de fundo noturno
ru: Ночной фон

source: Path to the night background
ar: مسار خلفية الليل
eu: Ibilbidea gaueko fondoara
gl: Ruta ao fondo nocturno
hu: Az éjszakai háttér elérési útja
it: Percorso dello sfondo notturno
pl: Ścieżka do nocnego tła
pt_br: Caminho para o fundo noturno
ru: Путь к ночному фону

source: Time source
ar: مصدر الوقت
eu: Denbora-iturria
gl: Fonte de tempo
hu: Idő forrása
it: Fonte per l'orario
pl: Pora dnia
pt_br: Fonte de tempo
ru: Источник времени

source: The source used to check current time
ar: المصدر المستخدم للتحقق من الوقت الحالي
eu: Gaur egungo ordua egiaztatzeko erabilitako iturria
gl: A fonte utilizada para comprobar a hora actual
hu: A jelenlegi idő ellenőrzéséhez használt forrás
it: La fonte usata per controllare l'ora attuale
pl: Źródło używane do sprawdzenia pory dnia
pt_br: Fonte usada para verificar a hora atual
ru: Источник, используемый для проверки текущего времени

source: Follow Night Light "Disable until tomorrow"
ar: اتبع الإضاءة الليلية "تعطيل حتى الغد"
eu: Gaueko argitik "bihar arte desaktibatu"
gl: Seguir "Desactivar até mañán" de luz nocturna
hu: Az éjszakai fény „Letiltás holnapig” funkciójának követése
it: Seguire "Disabilita fino a domani" della modalità notturna
pl: Naśladuj podświetlenie nocne "Wyłącz do jutra"
pt_br: Siga Luz noturna "Desativar até amanhã"
ru: Следите за ночной подсветкой "Отключить до завтра"

source: Switch back to day time when Night Light is temporarily disabled
ar: ارجع إلى وقت النهار عندما يتم تعطيل الإضاءة الليلية مؤقتًا
eu: Gaueko argia aldi baterako desaktibatuta dagoenean, itzuli eguneko ordura
gl: Volver á hora diurna cando luz nocturna esté temporalmente desactivada
hu: Visszaváltás nappali időre, ha az éjszakai fény átmenetileg le van tiltva
it: Tornare al tema diurno quando la modalità notturna è temporaneamente disabilitata
pl: Przełącz z powrotem do czasu dziennego gdy podświetlenie nocne jest chwilowo wyłączone
pt_br: Volte para dia quando a Luz noturna estiver temporariamente desativada
ru: Переключить обратно на дневную, когда ночная подсветка временно отключена

source: Always enable the on-demand timer
ar: قم دائمًا بتمكين المؤقت عند الطلب
eu: Tenporizadorea beti nahierara aktibatzea
gl: Activar sempre o temporizador á carta
hu: Mindig engedélyezze az igény szerinti időzítőt
it: Attiva sempre il timer a comando
pl: Zawsze włączaj ręczny minutnik
pt_br: Sempre habilite o timer sob demanda
ru: Всегда включать таймер по требованию

source: The on-demand timer will always be enabled alongside other timers
ar: سيتم دائمًا تمكين المؤقت عند الطلب جنبًا إلى جنب مع أجهزة ضبط الوقت الأخرى
eu: Nahierako tenporizadorea beti aktibatuko da beste tenporizadore batzuekin batera
gl: O temporizador á carta sempre se activará xunto con outros temporizadores
hu: Az igény szerinti időzítő mindig engedélyezve lesz a többi időzítő mellett
it: Il timer a comando sarà sempre attivo assieme agli altri timer
pl: Ręczny minutnik zawsze będzie włączony obok innych minutników
pt_br: O timer sob demanda sempre será habilitado junto com outros timers
ru: Таймер по требованию всегда будет включен наряду с другими таймерами

source: On-demand time
ar: وقت الطلب
eu: Denbora nahieran
gl: Tempo á carta
hu: Igény szerinti idő
it: Timer a comando
pl: Ręczny
pt_br: Tempo sob demanda
ru: Время по требованию

source: The current time used in on-demand mode
ar: الوقت الحالي المستخدم في وضع عند الطلب
eu: Egungo ordua, neurrira egindako moduan erabilia
gl: A hora actual utilizada no modo á carta
hu: Az igény szerinti módban használt jelenlegi idő
it: L'ora attuale usata nel timer a comando
pl: Aktualny czas używany w trybie ręcznym
pt_br: Hora atual usada no modo sob demanda
ru: Текущее время, используемое в режиме по требованию

source: Key combination to toggle time
ar: تركيبة المفاتيح لتبديل الوقت
eu: Teklen konbinazioa denbora kommutatzeko
gl: Combinación de teclas para trocar o tempo
hu: Billentyűkombináció az idő átváltásához
it: Combinazione di tasti per cambiare il tempo
pl: Kombinacja klawiszy do przełączania czasu
pt_br: Combinação de teclas para alternar o tempo
ru: Комбинация клавиш для переключения времени

source: The key combination that will toggle time in on-demand mode
ar: مجموعة المفاتيح التي ستبدل الوقت في وضع عند الطلب
eu: Denbora nahieran konbinatzen duen tekla-konbinazioa
gl: A combinación de teclas que troca o tempo no modo á carta
hu: Az a billentyűkombináció, amely átváltja az időt igény szerinti módban
it: La combinazione di tasti per cambiare il tempo nel timer a comando
pl: Kombinacja klawiszy do przełączania czasu w trybie ręcznym
pt_br: Combinação de teclas que alternará o tempo no modo sob demanda
ru: Комбинация клавиш, которая переключает время в режиме по требованию

source: On-demand button placement
ar: موضع زر عند الطلب
eu: Botoia nahierara jarri
gl: Colocación do botón á carta
hu: Igény szerinti gomb elhelyezése
it: Posizione del pulsante per l'attivazione a comando
pl: Położenie przycisku zmiany ręcznej
pt_br: Posicionamento do botão sob demanda
ru: Размещение кнопки по запросу

source: Where the on-demand button will be placed
ar: حيث سيتم وضع الزر عند الطلب
eu: Gutunaren botoia jarriko den lekuan
gl: Onde se colocará o botón de á carta
hu: Hol lesz az igény szerinti gomb elhelyezve
it: Dove sarà posizionato il pulsante per l'attivazione a comando
pl: Gdzie zostanie położony przycisk zmiany ręcznej
pt_br: Onde o botão sob demanda será colocado
ru: Где будет размещена кнопка включения по запросу

source: Use manual time source
ar: استخدم المصدر اليدوي للوقت
eu: Eskuzko denbora-iturria erabili
gl: Usar a fonte de tempo manual
hu: Kézi időforrás használata
it: Usa una programmazione manuale per l'orario
pl: Użyj manualnego wyznaczania pory dnia
pt_br: Use uma fonte de tempo manual
ru: Установить время вручную

source: Disable automatic time source detection
ar: تعطيل الكشف التلقائي عن مصدر الوقت
eu: Denbora-iturriaren detekzio automatikoa desaktibatu
gl: Desactivar a detección automática da fonte de tempo
hu: Időforrás automatikus felismerésének letiltása
it: Disattiva la rilevazione automatica della fonte per l'orario
pl: Wyłącz automatyczne wykrywanie pory dnia
pt_br: Desativar detecção automática da fonte de tempo
ru: Отключить автоматическое определение источника времени

source: Sunrise time
ar: وقت الشروق
eu: Egunsentiaren ordua
gl: Hora do amencer
hu: Napfelkelte ideje
it: Orario dell'alba
pl: Godzina wschodu słońca
pt_br: Hora do nascer do sol
ru: Время восхода солнца

source: When the day starts
ar: عندما يبدأ النهار
eu: Eguna hasten denean
gl: Cando comeza o día
hu: Mikor kezdődik a nap
it: Quando inizia il dì
pl: Kiedy rozpoczyna się dzień
pt_br: Quando o dia começa
ru: Начало дня

source: Sunset time
ar: وقت الغروب
eu: Ilunabarreko ordua
gl: Hora da posta de sol
hu: Napnyugta ideje
it: Orario del tramonto
pl: Godzina zachodu słońca
pt_br: Hora do pôr do sol
ru: Время захода солнца

source: When the day ends
ar: عندما ينتهي النهار
eu: Eguna amaitzen denean
gl: Cando remata o día
hu: Mikor végződik a nap
it: Quando termina il dì
pl: Kiedy kończy się dzień
pt_br: Quando o dia acabar
ru: Конец дня

source: Transition
ar: انتقال
hu: Átmenet
it: Transizione
pl: Przejście
pt_br: Transição
ru: Переход

source: Use a transition when changing the color scheme
ar: استخدم انتقالًا عند تغيير نظام الألوان
hu: Átmenet használata a színséma módosításakor
it: Usa una transizione al cambiare dei temi di colore
pl: Użyj przejścia podczas zmiany schematu kolorów
pt_br: Use uma transição ao mudar o esquema de cores
ru: Использовать переход при смене цветовой схемы

source: Change background
ar: غيّر الخلفية
eu: Aldatu fondoa
gl: Cambiar fondo
hu: Háttér megváltoztatása
it: Cambia lo sfondo
pl: Zmień tło
pt_br: Mudar plano de fundo
ru: Сменить фоновое изображение

source: Select your background image
ar: حدد صورة الخلفية الخاصة بك
eu: Hautatu hondoko irudia
gl: Seleccionar imaxe de fondo
hu: Válassza ki a háttérképet
it: Scegliere l'immagine di sfondo
pl: Wybierz swoje tło
pt_br: Selecione a imagem do plano de fundo
ru: Выбрать фоновое изображение

source: Backgrounds
ar: خلفيات
hu: Hátterek
it: Sfondi
pl: Tła
pt_br: Planos de fundo
ru: Фоны

source: Clear
ar: امسح
eu: Ezabatu
gl: Quitar
hu: Törlés
it: Elimina
pl: Wyczyść
pt_br: Claro
ru: Очистить

source: Commands
ar: أوامر
eu: Komandoak
gl: Ordes
hu: Parancsok
it: Comandi
pl: Polecenia
pt_br: Comandos
ru: Команды

source: Run commands
ar: قم بتشغيل الأوامر
eu: Komandoak exekutatu
gl: Executar ordes
hu: Parancsok futtatása
it: Eseguire dei comandi
pl: Uruchom polecenia
pt_br: Rodar comandos
ru: Выполнять команды

source: Sunrise
ar: شروق الشمس
eu: Egunsentia
gl: Amencer
hu: Napfelkelte
it: Alba
pl: Wschód słońca
pt_br: Nascer do sol
ru: Восход

source: notify-send "Hello sunshine!"
ar: أخطر وأرسل "أهلا بشروق الشمس!"
eu: notify-send "egunon!"
gl: notify-send "¡Bos días!"
hu: notify-send "Helló, napfény!"
it: notify-send "Buongiorno!"
pl: notify-send "Witaj słońce!"
pt_br: notify-send "Olá raio de sol!"
ru: notify-send "Привет солнечный свет!"

source: Sunset
ar: غروب الشمس
eu: Ilunabarra
gl: Atardecer
hu: Napnyugta
it: Tramonto
pl: Zachód słońca
pt_br: Pôr do sol
ru: Закат

source: notify-send "Hello moonshine!"
ar: أخطر وأرسل "أهلا بطلوع القمر!"
eu: notify-send "Gabon!"
gl: notify-send "¡Boas noites!"
hu: notify-send "Helló, holdfény!"
it: notify-send "Buonasera!"
pl: notify-send "Witaj księżycu!"
pt_br: notify-send "Olá, luar!"
ru: notify-send "Привет лунный свет!"

source: Contribute
ar: مساهمة
hu: Közreműködés
it: Contribuire
pl: Wesprzyj
pt_br: Contribuir
ru: Внести вклад

source: View the code and report issues
ar: عرض الكود البرمجي والإبلاغ عن الأخطاء
hu: Nézze át a kódot, és jelentse a hibákat
it: Esamina il codice e segnala i problemi
pl: Przejrzyj kod i zgłoś problemy
pt_br: Visualizar o código e reportar problemas
ru: Посмотреть код или сообщить о проблемах

source: Contribute to the translation
ar: ساهم في الترجمة
hu: Vegyen részt a fordításban
it: Contribuisci alla traduzione
pl: Wnieś wkład do tłumaczenia
pt_br: Contribuir para a tradução
ru: Внести вклад в перевод

source: Support me with a donation
ar: ادعمني بالتبرع
hu: Támogasson adománnyal
it: Sostienimi con una donazione
pl: Wesprzyj mnie dotacją
pt_br: Ajude com uma doação
ru: Поддержать пожертвованием

source: Schedule
ar: جدولة
eu: Ordutegia
gl: Horario
hu: Ütemezés
it: Programmazione
pl: Harmonogram
pt_br: Cronograma
ru: Расписание

source: Manual time source
ar: مصدر الوقت اليدوي
eu: Eskuzko denbora-iturria
gl: Fonte do tempo manual
hu: Kézi időforrás
it: Fonte manuale per l'orario
pl: Manualne wyznaczanie pory dnia
pt_br: Fonte de tempo manual
ru: Ручной источник времени

source: The extension will try to use Night Light or Location Services to automatically set your current sunrise and sunset times if they are enabled. If you prefer, you can manually choose a time source.
ar: سيحاول الامتداد استخدام الإضاءة الليلية أو خدمات الموقع لضبط أوقات شروق وغروب الشمس الحالية تلقائيًا إذا تم تمكينهما. إذا كنت تفضل ذلك، يمكنك اختيار مصدر الوقت يدويًا.
eu: Gaueko argiaren edo kokapenaren zerbitzuak erabiltzen saiatuko da luzapena, gaur egungo irteera eta ilunabar-orduak automatikoki ezartzeko, baldin eta ordu horiek aktibatuta badaude. Nahiago baduzu, eskuz aukera dezakezu denbora-iturri bat.
gl: A extensión tentará utilizar os servicios de luz nocturna ou de ubicación para fixar automáticamente as horas actuais de salida e posta do sol, se están activados. Se o prefire, pode elexir manualmente unha fonte de tempo.
hu: A kiterjesztés megpróbálja használni az éjszakai fényt vagy a helymeghatározási szolgáltatásokat, hogy automatikusan beállítsa az aktuális napfelkelte és napnyugta idejét, ha ezek engedélyezve vannak. Ha szeretné, akkor kézzel is kiválaszthatja az idő forrását.
it: L'estensione tenterà di usare la modalità notturna o i servizi di localizzazione, se attivati, per determinare automaticamente gli orari di alba e tramonto. Alternativamente, si può impostare l'orario manualmente.
pl: Rozszerzenie spróbuje użyć podświetlenia nocnego lub usług lokalizacji do automatycznego ustawienia godzin wschodu i zachodu słońca. Jeśli wolisz, możesz manualnie wybrać źródło pory dnia.
pt_br: A extensão tentará usar Luz noturna ou Serviços de localização para definir automaticamente os horários atuais do nascer e pôr do sol se estiverem ativados. Se preferir, você pode escolher manualmente uma fonte de tempo.
ru: Расширение попытается использовать Ночную Подсветку или Сервисы Местоположения, чтобы автоматически установить текущее время восхода и захода солнца, если они включены. При желании вы можете вручную выбрать источник времени.

source: Always show on-demand controls
ar: اعرض دائمًا عناصر التحكم عند الطلب
eu: Erakutsi beti kontrolak nahierara
gl: Mostrar sempre os controis á carta
hu: Mindig jelenítse meg az igény szerinti vezérlőket
it: Mostra sempre i controlli per l'attivazione a comando
pl: Zawsze pokazuj kontrolki trybu ręcznego
pt_br: Sempre mostrar controles sob demanda
ru: Всегда показывать элементы управления по требованию

source: Allows you to override the current time when using a schedule.
ar: يتيح لك تجاوز الوقت الحالي عند استخدام جدولة.
eu: Horri esker, ordutegi bat erabiltzen denean, egungo ordua baliogabetu daiteke.
gl: Isto permítelle anular a hora actual cando se utiliza un horario.
hu: Lehetővé teszi a jelenlegi idő felülbírálását, ha ütemezést használ.
it: Permette di sovrascrivere l'orario attuale quando la programmazione è attivata.
pl: Pozwala ci na nadpisanie obecnego czasu podczas używania harmonogramu.
pt_br: Permite que você substitua a hora atual ao usar um cronograma.
ru: Позволяет переопределить текущее время когда используется расписание.

source: Advanced
ar: متقدم
hu: Speciális
it: Avanzate
pl: Zaawansowany
pt_br: Avançado
ru: Продвинутое
