Repository: PikaOS-Linux/pkg-gnome-shell-extension-pika-darkmode
Catalog: src/po/*.po
Languages: ar, eu, gl, hu, it, pl, pt_br, ru

source: Smooth transition between day and night appearance.
ar: الانتقال السلس بين المظهر النهاري والليلي.
hu: Simább átmenet a nappali és éjszakai megjelenés között.
it: Transizione dolce tra l'aspetto diurno e notturno.
pl: Płynne przejście pomiędzy wyglądem dziennym a nocnym.
pt_br: Transição suave entre tema diurno e noturno.
ru: Плавный переход между дневным и ночным видом.

source: Night Light
ar: الإضاءة الليلية
eu: Gaueko argia
gl: Luz nocturna
hu: Éjszakai fény
it: Modalità notturna
pl: Podświetlenie nocne
pt_br: Luz noturna
ru: Ночная Подсветка

source: These settings only apply when Night Light is the time source.
ar: تنطبق هذه الإعدادات فقط عندما يكون Night Light هو مصدر الوقت.
hu: Ezek a beállítások csak akkor érvényesek, amikor az idő forrása az Éjszakai fény.
it: Queste impostazioni si applicano solo quando la fonte dell'orario è la modalità notturna.
pl: Te ustawienia będą stosowane gdy podświetlenie nocne wyznacza porę dnia.
pt_br: Essas configurações só se aplicam quando a Luz Noturna é usada como fonte do horário.
ru: Эти настройки применяются только если источником времени является Ночная Подсветка.

source: Follow <i>Disable until tomorrow</i>
ar: اتبع <i> تعطيل حتى الغد </i>
eu: Jarraitu <i>Desaktibatu bihar arte</i>
gl: Seguir <i>Desactivar até mañá</i>
hu: A <i>Letiltás holnapig</i> funkció követése
it: Segui <i>Disabilita fino a domani</i>
pl: Stosuj <i>Wyłącz do jutra</i>
pt_br: Siga <i>Desativar até amanhã</i>
ru: Следить <i>Отключить до завтра</i>

source: When Night Light is temporarily disabled, the extension will switch to day variants.
ar: عندما يتم تعطيل الإضاءة الليلية مؤقتًا، سيتحول الامتداد إلى متغيرات النهار.
eu: Gaueko argia aldi baterako desaktibatuta dagoenean, luzapena eguneko aldaeretara aldatuko da.
gl: Cando a luz nocturna esté temporalmente desactivada, a extensión cambiará a variantes diurnas.
hu: Ha az éjszakai fény átmenetileg le van tiltva, akkor a kiterjesztés át fog váltani a nappali változatokra.
it: Quando la modalità notturna è temporaneamente disattivata, l'estensione tornerà alle varianti diurne.
pl: Kiedy podświetlenie nocne jest chwilowo wyłączone, rozszerzenie przełączy warianty na dzienne.
pt_br: Quando a Luz noturna está temporariamente desativada, a extensão mudará para as variantes diurnas.
ru: Когда Ночная Подсветка временно отключена, расширение переключится на дневной вариант.

source: Manual schedule
ar: الجدولة اليدوية
eu: Eskuzko ordutegia
gl: Horario manual
hu: Kézi ütemezés
it: Programmazione manuale
pl: Manualny harmonogram
pt_br: Cronograma manual
ru: Ручное расписание

source: These settings only apply when using the manual schedule as the time source.
ar: تنطبق هذه الإعدادات فقط عند استخدام الجدول اليدوي كمصدر للوقت.
hu: Ezek a beállítások csak a kézi ütemezésű időforrásnál érvényesek.
it: Queste impostazioni si applicano solo quanto la fonte dell'orario è la programmazione manuale.
pl: Te ustawienia będą stosowane gdy manualny harmonogram wyznacza porę dnia.
pt_br: Essas configurações só se aplicam quando o agendamento manual é usado como fonte do horário.
ru: Эти настройки применяются только при использовании ручного расписания как источника времени.

source: On-demand
ar: عند الطلب
eu: Nahieran
gl: Á carta
hu: Igény szerint
it: A comando
pl: Ręcznie
pt_br: Sob demanda
ru: По запросу

source: These settings only apply when using the on-demand time source.
ar: تنطبق هذه الإعدادات فقط عند استخدام مصدر الوقت عند الطلب.
hu: Ezek a beállítások csak az igény szerinti időforrásnál érvényesek.
it: Queste impostazioni si applicano solo quando la modalità a comando è attiva.
pl: Te ustawienia będą stosowane gdy tryb ręczny wyznacza porę dnia.
pt_br: Essas configurações só se aplicam quando a fonte do horário for sob-demanda.
ru: Эти настройки применяются только при использовании источника времени по требованию.

source: Keyboard shortcut
ar: اختصار لوحة المفاتيح
eu: Teklatuaren lasterbidea
gl: Atallo de teclado
hu: Gyorsbillentyű
it: Scorciatoia da tastiera
pl: Śkrót klawiaturowy
pt_br: Atalho de teclado
ru: Комбинации клавиш

source: Button location
ar: زر الموقع
eu: Botoiaren kokapena
gl: Ubicación do botón
hu: Gomb helye
it: Posizione del pulsante
pl: Lokalizacja przycisku
pt_br: Localização do botão
ru: Расположение кнопки

source: Choose…
ar: اختر…
eu: Hautatu…
gl: Seleccionar…
hu: Válasszon…
it: Scegliere…
pl: Wybierz…
pt_br: Selecione…
ru: Выбрать…

source: Change keyboard shortcut
ar: تغيير اختصار لوحة المفاتيح
eu: Teklatuko lasterbidea aldatu
gl: Cambiar o atallo de teclado
hu: Gyorsbillentyű megváltoztatása
it: Cambiare la scorciatoia da tastiera
pl: Zmień skrót klawiaturowy
pt_br: Alterar atalho de teclado
ru: Сменить комбинации клавиш

source: Press your keyboard shortcut…
ar: اضغط على اختصار لوحة المفاتيح …
eu: Teklatuaren lasterbidea sartu…
gl: Escriba o atallo de teclado…
hu: Nyomja meg a gyorsbillentyűt…
it: Premere la scorciatoia da tastiera…
pl: Naciśnij skrót klawiaturowy…
pt_br: Pressione seu atalho de teclado …
ru: Введите вашу комбинацию клавиш…

source: Themes
ar: سمات
hu: Témák
it: Temi
pl: Motywy
pt_br: Temas
ru: Темы

source: GNOME has a built-in dark mode that the extension uses. Manually switching themes is discouraged and is only here for legacy reasons.
ar: يحتوي جنوم على وضع مظلم مدمج يستخدمه الامتداد. لا يُنصح بتبديل السمات يدويًا وهو موجود هنا فقط لأسباب قديمة.
hu: A GNOME beépített sötét móddal rendelkezik, amelyet a bővítmény használ. A témák kézi váltása nem ajánlott, és csak örökölt okok miatt van itt.
it: GNOME possiede una modalità scura integrata, usata dall'estensione. Cambiare i temi a mano è sconsigliato, e rimane possibile solo per ragioni storiche.
pl: GNOME posiada wbudowany tryb ciemny, z którego korzysta rozszerzenie. Manualna zmiana motywów jest odradzana i znajduje się tu z powodów związanych ze starszymi wersjami.
pt_br: O GNOME possui um tema escuro padrão que é o utilizado pela extensão. Não é recomendado alterar os temas manualmente. Esta opção só esta presente por fins de compatibilidade com versões anteriores do GNOME.
ru: GNOME имеет встроенный темный режим, который использует расширение. Ручное переключение тем не рекомендуется и используется только по устаревшим причинам.

source: Forcing a dark theme on applications not designed to support it can have undesirable side-effects such as unreadable text or invisible icons.
ar: قد يؤدي فرض سمة داكنة على التطبيقات غير المصممة لدعمها إلى آثار جانبية غير مرغوب فيها مثل النص غير المقروء أو الرموز غير المرئية.
hu: A sötét téma erőltetése ezt nem támogató alkalmazásokon nemkívánatos mellékhatásokkal járhat, például olvashatatlan szöveggel vagy láthatatlan ikonokkal.
it: Forzare il tema scuro su applicazioni non progettare per supportarlo può avere effetti indesiderati come testo illeggibile o icone invisibili.
pl: Wymuszane ciemnego motywu na aplikacjach nie zaprojektowanych z myślą o jego obsłudze może mieć niepożądane skutki uboczne takie jak nieczytelny tekst lub niewidoczne ikony.
pt_br: Forçar o uso de tema escuro em aplicações sem suporte para o mesmo pode resultar em visuais problemáticos, como texto ilegível ou ícones invisíveis.
ru: Принудительное использование темной темы в приложениях, не разработанных для ее поддержки, может иметь нежелательные побочные эффекты, такие как нечитаемый текст или невидимые значки.

source: Day variant
ar: متغير النهار
eu: Eguneko aldaera
gl: Variante diurna
hu: Nappali változat
it: Variante diurna
pl: Wariant dzienny
pt_br: Variante diurna
ru: Дневной вариант

source: Night variant
ar: متغير الليل
eu: Gaueko aldaera
gl: Variante nocturna
hu: Éjszakai változat
it: Variante notturna
pl: Wariant nocny
pt_br: Variante noturna
ru: Ночной вариант

source: Turn Night Mode Off
ar: قم بإيقاف تشغيل الوضع الليلي
hu: Éjszakai mód kikapcsolása
it: Disattiva modalità notturna
pl: Wyłącz tryb nocny
pt_br: Desativar Modo Noturno
ru: Выключить ночной режим

source: Turn Night Mode On
ar: قم بتشغيل الوضع الليلي
hu: Éjszakai mód bekapcsolása
it: Attiva modalità notturna
pl: Włącz tryb nocny
pt_br: Ativar Modo Noturno
ru: Включить ночной режим

source: Extension Settings
ar: إعدادات الامتداد
hu: Kiterjesztés beállításai
it: Impostazioni dell'estensione
pl: Ustawienia rozszerzenia
pt_br: Configurações da Extensão
ru: Настройки расширения

source: Night Mode Off
ar: الوضع الليلي معطل
hu: Éjszakai mód ki
it: Modalità notturna non attiva
pl: Tryb nocny wyłączony
pt_br: Modo Noturno Desativado
ru: Ночной режим выкл

source: Night Mode On
ar: الوضع الليلي مفعّل
hu: Éjszakai mód be
it: Modalità notturna attiva
pl: Tryb nocny włączony
pt_br: Modo Noturno Ativado
ru: Ночной режим вкл

source: Turn Off
ar: الايقاف
hu: Kikapcsolás
it: Disattiva
pl: Wyłącz
pt_br: Desativar
ru: Выключить

source: Turn On
ar: شغل
hu: Bekapcsolás
it: Attiva
pl: Włącz
pt_br: Ativar
ru: Включить

source: Only JPEG, PNG, TIFF, SVG and XML files can be set as background image.
ar: يمكن فقط تعيين ملفات JPEG و PNG و TIFF و SVG و XML كصورة خلفية.
hu: Csak JPEG, PNG, TIFF, SVG és XML fájlok állíthatók be háttérképként.
it: Solo file di tipo JPEG, PNG, TIFF, SVG e XML possono essere usati come immagini di sfondo.
pl: Tylko pliki JPEG, PNG, TIFF, SVG i XML mogą zostać ustawione jako tło.
pt_br: Apenas arquivos JPEG, PNG, TIFF, SVG e XML podem ser definidos como imagem de fundo.
ru: Только JPEG, PNG, TIFF, SVG и XML файлы могут быть установлены как фоновоге изображение.

source: Location Services
ar: خدمات الموقع
eu: Kokapen-zerbitzuak
gl: Servizos de localización
hu: Helymeghatározó szolgáltatások
it: Servizi di localizzazione
pl: Usługi lokalizacji
pt_br: Serviços de localização
ru: Сервисы местоположения

source: None
ar: لا شيء
eu: Bat ere ez
gl: Ningún
hu: Nincs
it: Nessuna
pl: Brak
pt_br: Desabilitado
ru: Нет

source: Top bar
ar: الشريط العلوي
eu: Goiko barra
gl: Barra superior
hu: Felső sáv
it: Barra superiore
pl: Górny pasek
pt_br: Barra superior
ru: Верхняя панель

source: System menu
ar: قائمة النظام
eu: Sistemaren menua
gl: Menú do sistema
hu: Rendszermenü
it: Menù di sistema
pl: Menu systemowe
pt_br: Menu do sistema
ru: Системное меню

source: Default
ar: الافتراضي
eu: Lehenetsita
gl: Por defecto
hu: Alapértelmezett
it: Predefinita
pl: Domyślny
pt_br: Padrão
ru: По умолчанию
